#include <string>
#include <iostream>
#define TRANSLATE_STD
#include "greek.h"

ονοματοχώρος Λογική {

κλάση Ζώο {
προσωπικά:
    ακερ μΠόδια{2};

προστατευμένα:
    στδ::κείμενο μΌνομα{""};
    
δημόσια:
    εικονικό ακερ ΠάρεΠόδια() σταθερ χωρίςεξερ {
        επέστρεψε μΠόδια;
    }

    στδ::κείμενο ΠάρεΌνομα() σταθερ χωρίςεξερ {
        επέστρεψε μΌνομα;
    }

    σταθερ στδ::κείμενο& σΠάρεΌνομα() σταθερ χωρίςεξερ {
        επέστρεψε μΌνομα;
    }
};

κλάση Σκύλος : δημόσια Ζώο {
δημόσια:
    συγκεκριμ Σκύλος(σταθερ στδ::κείμενο& εισΌνομα) {
        αυτό->μΌνομα = εισΌνομα;
    }
};
}

καλούπι<όνοματύπου Τ>
δομή Σημείο {
    Τ Χ;
    Τ Υ;
};


ακερ κύρια() {
    Λογική::Σκύλος* ΟΣκύλοςΜου = νέο Λογική::Σκύλος("Πέρης");
    σταθερ μηπροσημασμένος ακερ ΠόσαΠοδιαΈχειΟΣκύλοςΜου = ΟΣκύλοςΜου->ΠάρεΠόδια();

    διέγραψε ΟΣκύλοςΜου;
    ΟΣκύλοςΜου = μηδενοδεικτ;



    διάλεξε(ΠόσαΠοδιαΈχειΟΣκύλοςΜου) {
        περίπτ 0:
        //    στδ::χεξοδ << "Ο σκύλος μου δεν έχει πόδια." << στδ::τελγρ;
            σπάσε;
        περίπτ 4:
            στδ::χεξοδ << "Ο σκύλος μου έχει 4 πόδια." << στδ::τελγρ;
            σπάσε;
        προεπιλ:
            στδ::χεξοδ << "Ο σκύλος μου δεν έχει ούτε 4 ούτε κανένα πόδι." << στδ::τελγρ;
    }

    επέστρεψε ΠόσαΠοδιαΈχειΟΣκύλοςΜου;
}
